Revit 2026 API

# ElementTransformUtilsCopyElements(Document, ICollectionElementId, XYZ) Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static ICollection<ElementId> CopyElements(
	Document document,
	ICollection<ElementId> elementsToCopy,
	XYZ translation
)
```
```vb
Public Shared Function CopyElements (
	document As Document,
	elementsToCopy As ICollection(Of ElementId),
	translation As XYZ
) As ICollection(Of ElementId)
```
```cpp
public:
static ICollection<ElementId^>^ CopyElements(
	Document^ document,
	ICollection<ElementId^>^ elementsToCopy,
	XYZ^ translation
)
```
```fsharp
static member CopyElements :
        document : Document *
        elementsToCopy : ICollection<ElementId> *
        translation : XYZ -> ICollection<ElementId>
```

#### Parameters

document Document

elementsToCopy ICollectionElementId

translation XYZ

#### Return Value

ICollectionElementId

#### Reference

ElementTransformUtils Class

CopyElements Overload

Autodesk.Revit.DB Namespace